In [7]:
import numpy as np
import pandas as pd

In [8]:
cars_df = pd.read_csv("Cars.csv")

In [9]:
cars_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [10]:
cars_df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [11]:
cars_df.isnull().sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

In [12]:
cars_df['horsepower'] = pd.to_numeric(cars_df['horsepower'], errors='coerce')
cars_df['horsepower'].fillna(cars_df['horsepower'].mean(), inplace=True)

C:\Users\Giridharan\AppData\Local\Temp\ipykernel_22800\2935109763.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cars_df['horsepower'].fillna(cars_df['horsepower'].mean(), inplace=True)

In [13]:
cars_df['horsepower'] = pd.to_numeric(cars_df['horsepower'], errors='coerce')

In [14]:
cars_df['horsepower'].fillna(cars_df['horsepower'].mean(), inplace=True)

C:\Users\Giridharan\AppData\Local\Temp\ipykernel_22800\2037755598.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cars_df['horsepower'].fillna(cars_df['horsepower'].mean(), inplace=True)

In [15]:
cars_df['origin'].unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [16]:
cars_df['origin'].value_counts()

origin
usa       249
japan      79
europe     70
Name: count, dtype: int64

In [17]:
cars_df.groupby('origin')['mpg'].mean()

origin
europe    27.891429
japan     30.450633
usa       20.083534
Name: mpg, dtype: float64

In [18]:
cars_df[cars_df['mpg'] == cars_df['mpg'].max()][['name', 'mpg']]

          name   mpg
322  mazda glc  46.6

In [19]:
cars_df[cars_df['horsepower'] == cars_df['horsepower'].max()][['name', 'horsepower']]

                   name  horsepower
116  pontiac grand prix       230.0

In [20]:
(cars_df['mpg'] >= 35).sum()

np.int64(36)

In [21]:
filtered_df = cars_df[(cars_df['horsepower'] > 100) & (cars_df['weight'] < 3000)]
filtered_df['origin'].value_counts().idxmax()

'usa'

In [22]:
round(cars_df[cars_df['origin'] == 'japan']['acceleration'].mean(), 2)

np.float64(16.17)

In [23]:
cars_df.groupby('model_year')['mpg'].mean().idxmax()

np.int64(80)